#### OpenTofu Format and Style 🖌`failure`
#### OpenTofu Initialization ⚙️`success`
#### OpenTofu Validation 🤖`success`
<details><summary>Validation Output</summary>

```golang

Success! The configuration is valid.

```

</details>

#### OpenTofu Plan 📖`success`

<details><summary>Show Plan</summary>

```golang

tofu
module.k3s-controlplane.data.digitalocean_ssh_key.macbook: Reading...
data.digitalocean_droplets.k3s_cluster: Reading...
module.k3s-controlplane.data.digitalocean_ssh_key.macbook: Read complete after 0s [name=Personal Macbook]
data.digitalocean_droplets.k3s_cluster: Read complete after 0s [id=droplets/12695051515308228492]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # digitalocean_firewall.k3s_cluster will be created
  + resource "digitalocean_firewall" "k3s_cluster" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + name            = "k3s-cluster"
      + pending_changes = (known after apply)
      + status          = (known after apply)

      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + inbound_rule {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "443"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "53"
          + protocol                       = "tcp"
        }
      + outbound_rule {
          + destination_addresses          = [
              + "0.0.0.0/0",
              + "::/0",
            ]
          + destination_droplet_ids        = []
          + destination_kubernetes_ids     = []
          + destination_load_balancer_uids = []
          + destination_tags               = []
          + port_range                     = "80"
          + protocol                       = "tcp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf-digitalocean.plan

To perform exactly these actions, run the following command to apply:
    tofu apply "tf-digitalocean.plan"

```

</details>

*Pusher: @TheOpsDev, Action: `pull_request`, Working Directory: `opentofu/digitalocean`, Workflow: `OpenTofu Comment PR`*